Repository: ShatskV/telega_bot_api_mindset
Catalog: locales/*/LC_MESSAGES/picpackbot.po
Languages: ru

source: list
ru: список

source: instagram
ru: инстаграм

source: #tag1 #tag2 #tag3
ru: #тег1, #тег2, #тег3

source: tag1, tag2, tag3
ru: тег1, тег2, тег3

source: On
ru: Вкл.

source: Off
ru: Выкл.

source: on
ru: включен

source: off
ru: выключен

source: Rating was turned {state}
ru: Рейтинг был {state}

source: Language was changed to English!
ru: Язык был изменен на Русский!

source: Tags format was changed to {fmt}
ru: Формат тегов изменен на {fmt}

source: Thank you for rating!
ru: Спасибо за оценку!

source: No token for Yandex.disk! Please, recieve token: <a href="{url}">Token</a> And add with command /yandex_token YOUR_TOKEN
ru: Нет токена для Яндекс.диска! Пожалуйста, получите токен: <a href="{url}">Токен</a> И добавьте командой /yandex_token ВАШ_ТОКЕН

source: Please, rate the result!
ru: Пожалуйста, оцените результат!

source: Choose rating setting:
ru: Выберите настройку рейтинга:

source: Wrong format! Should be /rating 1/0/on/off
ru: Неправильный формат! Должно быть /rating + 1/0/on/off

source: Rating was turned {}
ru: Рейтинг был

source: Choose your language:
ru: Выберите ваш язык:

source: No arguments! Should be /lang {lang}
ru: Нет аргументов! Должно быть /lang {lang}

source: Language was change to English!
ru: Язык был изменен на Русский!

source: Language not supported or wrong format!
ru: Язык не поддерживается или неправильный формат!

source: Choose tags format:
ru: Выберите формат тегов:

source: Tags format was changed to {tag_value}
ru: Формат тегов изменен на {tag_value}

source: Wrong tags format!
ru: Неправильный формат тегов!

source: <b>Picpack Bot</b> <b><i>Description:</i></b> Bot generates description and list of tags for any image. Just send a picture And it supports link to image Also bot support saving pictures to your Yandex.disk In group bot only saves images to Yandex.disk with sorting by tags This is private mode! Visit ower site: http://app.picpack.io/demo_en Chat with owner: @FrankShikhaliev Below is a list of available commands, also they could have arguments (in brackets): /lang - change language ({langs}) /tags - change format tags (list, instagram) /rating - rate result on/off (1, 0, on, off) /feedback - leave feedback about our bot <b><i>Yandex.disk:</i></b> /yandex_token YOUR_TOKEN - change Yandex.disk token Get token: <a href="{url}">Token</a>/yandex - saving images to Yandex.Disk turn on/off (1, 0, on, off) /only_save_to_yandex - saving images without tags to Yandex.Disk turn on/off (1, 0, on, off)
ru: <b>Picpack Bot</b> <b><i>Описание:</i></b> Бот создает описание и список тегов для любого изображения. Просто пришлите картинку И он поддерживает ссылки на изображения Также бот поддерживет сохранение картинок на Яндекс.диск В группе бот только сохранет изображения, сортируя по тэгам Это приватным режим! Посетите наш сайт: http://app.picpack.io/demo_ru Чат с владельцем: @FrankShikhaliev Ниже список доступных команд, также они имеют аргументы (в скобках): /lang - изменить язык ({langs}) /tags - изменить формат тэгов (list, instagram) /rating - оценка результата включена/выключена (1, 0, on, off) /feedback - оставьте отзыв о нашем боте <b><i>Яндекс.диск:</i></b> /yandex_token ВАШ_ТОКЕН - изменить токен Яндекс.диска Получить токен: <a href="{url}">Токен</a> /yandex - сохранение на Яндекс.диск включено/выключено (1, 0, on, off) /only_save_to_yandex - сохранение на Яндекс.диск без тегов включено/выключено (1, 0, on, off)

source: <b>Picpack Bot</b> <b><i>Description:</i></b> Bot sorts images in group by tag and saves them to Yandex.disk to tag folder Please recieve Yandex.disk token: <a href="{url}">Token</a> And save it with command /yandex_token YOUR_TOKEN In private chat bot Bot generates description and list of tags for any image. This is group mode! Visit ower site: http://app.picpack.io/demo_en Chat with owner: @FrankShikhaliev Below is a list of available commands, also they could have arguments (in brackets): /lang - change language ({langs}) /yandex - saving images to Yandex.Disk turn on/off (1, 0, on, off) /only_save_to_yandex - saving images without tags to Yandex.Disk turn on/off (1, 0, on, off) /yandex_token YOUR_TOKEN - change Yandex.disk token /sort, /save - sort or save pictures when privacy mode is on
ru: <b>Picpack Bot</b> <b><i>Описание:</i></b> Бот сортирует по тегам изображения в группе и сохраняет их на Яндекс.диск в папку тегов Пожалуста, получите токен Яндекс.диска: <a href="{url}">Token</a> И сохраните его командой /yandex_token ВАШ_ТОКЕН В приватном чате бот создает описание и список тегов для любого изображения. Это групповой режим! Посетите наш чат: http://app.picpack.io/demo_ru Чат с владельцем: @FrankShikhaliev Ниже список доступных команд, также они имеют аргументы (в скобках): /lang - изменить язык ({langs}) /yandex - сохранение на Яндекс.диск включено/выключено (1, 0, on, off) /only_save_to_yandex - сохранение на Яндекс.диск без тегов включено/выключено (1, 0, on, off) /yandex_token ВАШ_ТОКЕН - изменить токен Яндекс.диска /sort, /save - отсортировать или сохранить картинки, когда режим конфиденциальности включен

source: Thank you for feedback!
ru: Спасибо за отзыв!

source: Please, leave feedback:
ru: Пожалуйста, оставьте отзыв:

source: Sorry, bot doesn't support this file format!
ru: Извините, бот не поддерживает этот формат файла!

source: Token is missing! Should be /yandex_token YOUR_TOKEN
ru: Не найден токен! Должно быть /yandex_token ВАШ_ТОКЕН

source: Token is invalid! Please, get new one: <a href="{url}">Token</a>
ru: Токен неверный! Пожалуйста, получите новый: <a href="{url}">Токен</a>

source: Token was changed, but not verified
ru: Токен был изменен, но не проверен

source: Token was changed and verified
ru: Токен был изменен, но не проверен

source: Downloading to Yandex.disk was turned on. But you should recieve Yandex token: <a href="{url}">Token</a> Then add token with command /yandex_token YOUR_TOKEN
ru: Загрузка на Яндекс.диск была включена. Но вы должны получить токен Яндекса: <a href="{url}">Токен</a> Затем добавьте его командой /yandex_token ВАШ_ТОКЕН

source: Downloading to Yandex.disk was turned on
ru: Загрузка на Яндекс.диск была включена

source: Downloading to Yandex.disk was turned off
ru: Загрузка на Яндекс.диск была выключена

source: Bad arguments! Should be /only_save_to_yandex 1/0/on/off
ru: Неверные аргументы! Должно быть Should be /only_save_to_yandex 1/0/on/off

source: Images will be only save to Yandex.disk
ru: Изображения будут только сохранены на Яндекс.диск

source: Images will be with tags and save to Yandex.disk
ru: Изображения будут сохранены по тегам на Яндекс.диск

source: Please, reply this message with image
ru: Пожалуйста, ответьте на сообщение изображением

source: Don't understand you!
ru: Не понимаю Вас!

source: <b>Invalid photo url!<b>
ru: <b>Неверный адрес фото!</b>

source: <b>Service unavailable!</b>
ru: <b>Сервис недоступен!</b>

source: <b>Description:</b>
ru: <b>Описание:</b>

source: Service unavailable!
ru: Сервис недоступен!

source: <b>Tags:</b>
ru: <b>Теги:</b>

source: Sorry, tags not found!
ru: Извините, теги не найдены!

source: Bad Yandex.disk token! Please, recieve new one: <a href="{url}">Token</a>
ru: Неверный токен Яндекс.диска! Пожалуйста, получите новый: <a href="{url}">Токен</a>

source: Error while uploading to Yandex.disk!
ru: Ошибка по время загрузки на Яндекс.диск!
